In [3]:
import pandas as pd

In [4]:
df=pd.read_csv('Retail_Dataset.csv')

In [5]:
df.shape

(100000, 10)

In [6]:
df.head()

,CustomerID,ProductID,Quantity,Price,TransactionDate,PaymentMethod,StoreLocation,ProductCategory,DiscountApplied(%),TotalAmount
0,109318,C,7,80.079844,12/26/2023 12:32,Cash,"176 Andrew Cliffs\nBaileyfort, HI 93354",Books,18.677100,455.862764
1,993229,C,4,75.195229,8/5/2023 0:00,Cash,"11635 William Well Suite 809\nEast Kara, MT 19483",Home Decor,14.121365,258.306546
2,579675,A,8,31.528816,3/11/2024 18:51,Cash,"910 Mendez Ville Suite 909\nPort Lauraland, MO...",Books,15.943701,212.015651
3,799826,D,5,98.880218,10/27/2023 22:00,PayPal,"87522 Sharon Corners Suite 500\nLake Tammy, MO...",Books,6.686337,461.343769
4,121413,A,7,93.188512,12/22/2023 11:38,Cash,"0070 Michelle Island Suite 143\nHoland, VA 80142",Electronics,4.030096,626.030484

In [9]:
df.drop(columns=['CustomerID','ProductID','StoreLocation'],axis=1,inplace=True)

In [10]:
df.head()

,Quantity,Price,TransactionDate,PaymentMethod,ProductCategory,DiscountApplied(%),TotalAmount
0,7,80.079844,12/26/2023 12:32,Cash,Books,18.677100,455.862764
1,4,75.195229,8/5/2023 0:00,Cash,Home Decor,14.121365,258.306546
2,8,31.528816,3/11/2024 18:51,Cash,Books,15.943701,212.015651
3,5,98.880218,10/27/2023 22:00,PayPal,Books,6.686337,461.343769
4,7,93.188512,12/22/2023 11:38,Cash,Electronics,4.030096,626.030484

In [11]:
df.isna().sum()

Quantity              0
Price                 0
TransactionDate       0
PaymentMethod         0
ProductCategory       0
DiscountApplied(%)    0
TotalAmount           0
dtype: int64

In [13]:
df['Price'].mean()

55.067344419007405

In [14]:
df['ProductCategory'].unique()

array(['Books', 'Home Decor', 'Electronics', 'Clothing'], dtype=object)

In [17]:
top_2_highest_discount=df.sort_values(by='DiscountApplied(%)' ,ascending=False)['ProductCategory'].head()

In [16]:
top_2_highest_discount

30289          Books
8487      Home Decor
18344    Electronics
Name: ProductCategory, dtype: object

In [18]:
category_discount = df.groupby('ProductCategory')['DiscountApplied(%)'].mean().reset_index()

# Sort by discount in descending order and take the top 2 categories
top_discount_categories = category_discount.sort_values(by='DiscountApplied(%)', ascending=False).head(2)
top_discount_categories

  ProductCategory  DiscountApplied(%)
3      Home Decor           10.082572
1        Clothing           10.019378

In [19]:
df['TotalAmount'].mean()

248.33495506385518

1.Calculate the total sales amount for each product category.

In [20]:
total_sales_amount=df.groupby('ProductCategory')['TotalAmount'].sum().reset_index()

In [22]:
total_sales_amount['TotalAmount'] = total_sales_amount['TotalAmount'].apply(lambda x: f'Rs {x}')
total_sales_amount

  ProductCategory           TotalAmount
0           Books  Rs 6257837.043115523
1        Clothing   Rs 6205502.34875466
2     Electronics  Rs 6196734.758744204
3      Home Decor  Rs 6173421.355771132

2.Find the average discount applied for each product category.

In [25]:
category_discount = df.groupby('ProductCategory')['DiscountApplied(%)'].mean().reset_index()
category_discount

  ProductCategory  DiscountApplied(%)
0           Books            9.996935
1        Clothing           10.019378
2     Electronics            9.981941
3      Home Decor           10.082572

3Identify the two payment methods that were used the most.

In [31]:
df['PaymentMethod'].value_counts().sort_values(ascending=False).head(2)

PaymentMethod
PayPal         25067
Credit Card    25034
Name: count, dtype: int64

4.Calculate the total quantity of products sold each month.

In [32]:
df['TransactionDate'] = pd.to_datetime(df['TransactionDate'])

In [33]:
df['month']=df['TransactionDate'].dt.month

In [34]:
df

,Quantity,Price,TransactionDate,PaymentMethod,ProductCategory,DiscountApplied(%),TotalAmount,month
0,7,80.079844,2023-12-26 12:32:00,Cash,Books,18.677100,455.862764,12
1,4,75.195229,2023-08-05 00:00:00,Cash,Home Decor,14.121365,258.306546,8
2,8,31.528816,2024-03-11 18:51:00,Cash,Books,15.943701,212.015651,3
3,5,98.880218,2023-10-27 22:00:00,PayPal,Books,6.686337,461.343769,10
4,7,93.188512,2023-12-22 11:38:00,Cash,Electronics,4.030096,626.030484,12
...,...,...,...,...,...,...,...,...
99995,2,56.078258,2023-07-17 16:59:00,Credit Card,Clothing,18.345145,91.581240,7
99996,6,88.516406,2023-05-30 09:04:00,Credit Card,Electronics,3.995541,509.878179,5
99997,4,72.385564,2023-08-25 07:59:00,Credit Card,Clothing,17.423979,239.092472,8
99998,5,66.542239,2024-02-05 19:45:00,PayPal,Electronics,14.345018,284.983717,2
99999,5,38.087766,2024-02-04 11:53:00,Debit Card,Home Decor,2.966058,184.790305,2

In [35]:
total_quantity = df.groupby('month')['Quantity'].sum().reset_index()
total_quantity

    month  Quantity
0       1     42702
1       2     40105
2       3     42551
3       4     39215
4       5     42121
5       6     41630
6       7     43051
7       8     42588
8       9     41204
9      10     41284
10     11     41822
11     12     42656

5.Find the highest total amount transaction for each product category.

In [36]:
highest_amount=df.groupby('ProductCategory')['TotalAmount'].max().reset_index()

In [37]:
highest_amount

  ProductCategory  TotalAmount
0           Books   895.343955
1        Clothing   889.148765
2     Electronics   890.821751
3      Home Decor   896.141242

###### .Determine the most common product category for each payment method.

In [48]:
highest_amount = df.groupby(['ProductCategory', 'PaymentMethod']).size().reset_index(name='Count')

In [51]:
max_count=highest_amount.groupby('ProductCategory')['Count'].sort_values(ascending=False).head(2)

AttributeError: 'SeriesGroupBy' object has no attribute 'sort_values'

In [57]:
max_indices = highest_amount.groupby('ProductCategory')['Count'].idxmax()
max_count = highest_amount.loc[max_indices, ['ProductCategory', 'PaymentMethod', 'Count']]

In [59]:
max_count

   ProductCategory PaymentMethod  Count
3            Books        PayPal   6341
5         Clothing   Credit Card   6345
9      Electronics   Credit Card   6295
14      Home Decor    Debit Card   6312

7.Calculate the total sales amount for each day of the week.

In [61]:
day_mapping = {
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
}

In [70]:
date=df.iloc[0]['TransactionDate']

In [72]:
df['TransactionDate'].dayodweek

In [73]:
day

1

In [75]:
df['dayodweek']=df['TransactionDate'].apply(lambda x: day_mapping[x.dayofweek])

In [76]:
df.head()

,Quantity,Price,TransactionDate,PaymentMethod,ProductCategory,DiscountApplied(%),TotalAmount,month,dayodweek
0,7,80.079844,2023-12-26 12:32:00,Cash,Books,18.677100,455.862764,12,Tuesday
1,4,75.195229,2023-08-05 00:00:00,Cash,Home Decor,14.121365,258.306546,8,Saturday
2,8,31.528816,2024-03-11 18:51:00,Cash,Books,15.943701,212.015651,3,Monday
3,5,98.880218,2023-10-27 22:00:00,PayPal,Books,6.686337,461.343769,10,Friday
4,7,93.188512,2023-12-22 11:38:00,Cash,Electronics,4.030096,626.030484,12,Friday

In [82]:
total_sales=amount=df.groupby('dayodweek')['TotalAmount'].sum().reset_index()

In [83]:
total_sales['TotalAmount']=total_sales['TotalAmount'].apply(lambda x: f' Rs{x}')

In [84]:
total_sales

   dayodweek           TotalAmount
0     Friday   Rs3547941.974009546
1     Monday   Rs3493463.017611088
2   Saturday   Rs3581301.899562005
3     Sunday   Rs3535349.550881768
4   Thursday   Rs3604946.268456236
5    Tuesday   Rs3529847.983460677
6  Wednesday   Rs3540644.812404199

Find the top 3 most purchased product categories based on quantity.

In [85]:
df.head()

,Quantity,Price,TransactionDate,PaymentMethod,ProductCategory,DiscountApplied(%),TotalAmount,month,dayodweek
0,7,80.079844,2023-12-26 12:32:00,Cash,Books,18.677100,455.862764,12,Tuesday
1,4,75.195229,2023-08-05 00:00:00,Cash,Home Decor,14.121365,258.306546,8,Saturday
2,8,31.528816,2024-03-11 18:51:00,Cash,Books,15.943701,212.015651,3,Monday
3,5,98.880218,2023-10-27 22:00:00,PayPal,Books,6.686337,461.343769,10,Friday
4,7,93.188512,2023-12-22 11:38:00,Cash,Electronics,4.030096,626.030484,12,Friday

In [90]:
top_prodcuct=df.groupby('ProductCategory')['Quantity'].sum().reset_index()

In [91]:
top_prodcuct

  ProductCategory  Quantity
0           Books    126047
1        Clothing    125044
2     Electronics    125347
3      Home Decor    124491

In [93]:
top_prodcuct=top_prodcuct.sort_values(by='Quantity',ascending=False).head(3)

In [94]:
top_prodcuct

  ProductCategory  Quantity
0           Books    126047
2     Electronics    125347
1        Clothing    125044

8.Calculate the total discount applied for each payment method.

In [95]:
total_discount=df.groupby('PaymentMethod')['DiscountApplied(%)'].sum().reset_index()

In [96]:
total_discount

  PaymentMethod  DiscountApplied(%)
0          Cash       250905.711760
1   Credit Card       251120.136552
2    Debit Card       249110.857851
3        PayPal       250878.747754

9Identify the transaction with the highest total amount.

In [97]:
top_transaction =df.groupby('PaymentMethod')['TotalAmount'].sum().reset_index()

In [100]:
top_transaction['TotalAmount']=top_transaction['TotalAmount'].apply(lambda x: f'Rs {x}')

In [101]:
top_transaction

  PaymentMethod           TotalAmount
0          Cash  Rs 6207205.950565307
1   Credit Card  Rs 6203537.870380674
2    Debit Card  Rs 6202998.848452339
3        PayPal  Rs 6219752.836987199

Find the average price of products in each product category.

In [103]:
average_price =df.groupby('ProductCategory')['TotalAmount'].mean().reset_index()

In [104]:
average_price['TotalAmount']=average_price['TotalAmount'].apply(lambda x: f'Rs {x}')

In [105]:
average_price

  ProductCategory            TotalAmount
0           Books  Rs 250.00347741262925
1        Clothing   Rs 247.6653236252658
2     Electronics  Rs 247.96857778088054
3      Home Decor  Rs 247.69976952096985

Calculate the total sales amount per transaction.

In [106]:
per_transcation=df['TotalAmount'].mean()

In [107]:
per_transcation

248.33495506385518

In [108]:
###Calculate the total sales amount for transactions where the discount applied is greater than 20%.

In [115]:
filtered_df = df[df['DiscountApplied(%)'] > 15]

In [114]:
df['DiscountApplied(%)'].max()

19.99958523

In [116]:
filtered_df

,Quantity,Price,TransactionDate,PaymentMethod,ProductCategory,DiscountApplied(%),TotalAmount,month,dayodweek
0,7,80.079844,2023-12-26 12:32:00,Cash,Books,18.677100,455.862764,12,Tuesday
2,8,31.528816,2024-03-11 18:51:00,Cash,Books,15.943701,212.015651,3,Monday
6,7,13.121937,2023-12-26 05:32:00,PayPal,Clothing,16.295127,76.885907,12,Tuesday
8,5,23.857981,2024-02-27 11:13:00,Credit Card,Electronics,18.703997,96.977925,2,Tuesday
14,5,95.011762,2023-10-27 17:50:00,Cash,Clothing,16.248395,397.869376,10,Friday
...,...,...,...,...,...,...,...,...,...
99991,4,77.927041,2024-03-22 17:41:00,Debit Card,Books,17.343479,257.647124,3,Friday
99992,1,82.566022,2024-01-17 22:51:00,Debit Card,Electronics,19.577356,66.401778,1,Wednesday
99994,5,53.600296,2023-06-29 03:36:00,Cash,Clothing,18.832064,217.531271,6,Thursday
99995,2,56.078258,2023-07-17 16:59:00,Credit Card,Clothing,18.345145,91.581240,7,Monday
99997,4,72.385564,2023-08-25 07:59:00,Credit Card,Clothing,17.423979,239.092472,8,Friday

In [117]:
sales_amount =filtered_df.groupby('PaymentMethod')['TotalAmount'].sum().reset_index()

In [118]:
sales_amount

  PaymentMethod   TotalAmount
0          Cash  1.431099e+06
1   Credit Card  1.414078e+06
2    Debit Card  1.418848e+06
3        PayPal  1.417491e+06